export const regexMatch = {
    /* 验证全小写字母 */
    lower: new RegExp('^[a-z]+$'),
    /* 验证全大写字母 */
    upper: new RegExp('^[A-Z]+$'),
    /* 验证小写字母开头 */
    lowerStart: new RegExp('^[a-z]\\w*$'),
    /* 验证大写字母开头 */
    upperStart: new RegExp('^[A-Z]\\w*$'),
    /* 验证是否中文 */
    chs: new RegExp('^[\u4e00-\u9fa5]+$'),
    /* 验证英文和数字 */
    chsAlphaNum: new RegExp('^[a-zA-Z0-9]$'),
    /* 验证英文数字和下划线 */
    alphaDash: new RegExp('^[a-zA-Z0-9-_]+$'),
    /* 验证手机号码 */
    mobileNum: new RegExp('^1[3456789]\\d{9}$'),
    /* 验证电话号码 */
    phoneNum: new RegExp('^\\d{3}-\\d{8}|\\d{4}-\\d{7}$'),
    /* 验证不带协议的url */
    urlWithoutProtocol: new RegExp('^//[\\w.-]+(?:\\.[\\w.-]+)+[\\w\\-._~:/?#[\\]@!$&\'*+,;=]+$'),
    /* 验证有效ipV4地址 */
    ipaddressV4: new RegExp('^(([1-9]?\\d|1\\d{2}|2[0-4]\\d|25[0-5]).){3}([1-9]?\\d|1\\d{2}|2[0-4]\\d|25[0-5])$'),
    /* 验证有效身份证 */
    identity: new RegExp('^[1-9][0-9]{5}(19[0-9]{2}|20[0|1][0-9])(0[1-9]|1[0|2])(0[1-9]|[1|2][0-9]|3[0|1])[0-9]{3}([0-9]|X)+$'),
    /** 验证有效ipV6地址 */
    ipaddressV6: new RegExp(
        // eslint-disable-next-line max-len
        '(([0-9a-fA-F]{1,4}:){7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]+|::(ffff(:0{1,4})?:)?((25[0-5]|(2[0-4]|1?[0-9])?[0-9])\\\\.){3}(25[0-5]|(2[0-4]|1?[0-9])?[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1?[0-9])?[0-9])\\\\.){3}(25[0-5]|(2[0-4]|1?[0-9])?[0-9]))',
    ),
}
